---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.StructuralAssetFailures
source: html/6086540a-49f8-a423-2386-afe7b5bb6861.htm
---
# BuiltInFailures.StructuralAssetFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.